

/**********************************************************************************************************
**** 文件名：Sensor_AD.c
**** 
**** 文件描述：AD模块函数库
****		   可用AD端口：ADC0 ----- P1.7    ADC1 ----- P2.0    ADC2 ----- P2.1	ADC3 ----- P2.2
****					   ADC4 ----- P2.3	  ADC5 ----- P2.4	 ADC6 ----- P2.5	ADC7 ----- P2.6
****		   			   ADC8 ----- P2.7	  ADC9 ----- P3.0	 
****		  对应AD通道号是ADC0———1...ADC9——10
****
**** 创建人：FeiChen
**** 
**** 版本号：1.0
**** 
**** 修改记录：
**** 
**** 
****
***********************************************************************************************************/

//定义红外测距查表值
code char IRData[256] = {	255,255,255,255,255,255,255,255,255,255,//第一组：10个
							200,200,200,200,200,150,150,150,150,150,//第二组：10个
							100,100,100,100,100, 90, 90, 90, 90, 90,//第三组：10个
							 85, 85, 85, 80, 80, 80, 75, 75, 70, 70,//第四组：10个
							 65, 60, 57, 55, 54, 51, 50, 48, 47, 46,//第五组：10个
							 45, 43, 40, 39, 38, 37, 36, 36, 35, 35,//第六组：10个
							 34, 34, 33, 33, 32, 32, 31, 31, 30, 30,//第七组：10个
							 29, 29, 28, 28, 27, 27, 27, 26, 26, 26,//第八组：10个
							 25, 25, 25, 24, 24, 24, 24, 23, 23, 23,//第九组：10个
							 23, 22, 22, 22, 22, 21, 21, 21, 21, 20,//第十组：10个
							 20, 20, 20, 20, 19, 19, 19, 19, 18, 18,//第11组：10个
							 18, 18, 18, 17, 17, 17, 17, 17, 17, 16,//第12组：10个
							 16, 16, 16, 16, 16, 16, 15, 15, 15, 15,//第13组：10个
							 15, 15, 14, 14, 14, 14, 14, 14, 14, 14,//第14组：10个
							 14, 13, 13, 13, 13, 13, 13, 13, 13, 13,//第15组：10个
							 13, 12, 12, 12, 12, 12, 12, 12, 12, 12,//第16组：10个
							 12, 12, 11, 11, 11, 11, 11, 11, 11, 11,//第17组：10个
							 11, 11, 11, 11, 11, 10, 10, 10, 10, 10,//第18组：10个
							 10, 10, 10, 10, 10, 10, 10, 10, 10, 10,//第19组：10个
							 10,  9,  9,  9,  9,  9,  9,  9,  9,  9,//第20组：10个
							  9,  9,  9,  9,  9,  9,  9,  9,  8,  8,//第21组：10个
							  8,  8,  8,  8,  8,  8,  8,  8,  8,  8,//第22组：10个
							  8,  8,  8,  8,  8,  8,  8,  7,  7,  7,//第23组：10个
							  7,  7,  6,  6,  6,  6,  6,  6,  0,  0,//第24组：10个
							  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,//第25组：10个
							  0,  0,  0,  0,  0,  0,//第26组：6个								
							};




/*************************************************************
//! 头文件
**************************************************************/
#include "Sensor_AD.h"

#define AD_NUM  10		// 总共可选10路AD端口
/*************************************************************************************************
*****
***** 函数名：unsigned char GetIR_Distance(unsigned char channle)
*****
***** 入口参数：channle：选择的第几路AD端口值，取值为1-10
*****
*****
***** 功能描述：获取红外传感器感测距离，先经过AD转换获取相应的电压值，然后将电压值经过距离函数转成
*****			障碍物的距离10——80cm				
*****		   
*****
***** 返回值：返回的就是红外测距距离值，取值范围0-255，但是10—80区间为有效红外测距距离值
*****
***** 作者：FeiChen
**************************************************************************************************/


unsigned char GetIR_Distance(unsigned char channle)
{
	xdata unsigned int ucIRDisValue = 0;


	//AD通道错误处理
	if(channle<0 || channle>10)
	{
		return 0;
	}
	//获取AD转换值
	ucIRDisValue = ADC_DistanceGet(channle);

	//将AD转换值切换成距离值
	ucIRDisValue = ((int)SensorDistanceProcess(ucIRDisValue));

	//设置距离值不超过255
	if(ucIRDisValue>255)
	{
		ucIRDisValue = 255;
	}
	return (char)ucIRDisValue;
	
}


/*************************************************************************************************
*****
***** 函数名：unsigned int GetIRDistance(unsigned char channle)
*****
***** 入口参数：channle：选择的第几路AD端口值，取值为1-10
*****
*****
***** 功能描述：获取对应通道号的AD采样值
*****						
*****		   
*****
***** 返回值：返回对应通道AD采样值，取值范围是0—1024
*****
***** 作者：FeiChen
**************************************************************************************************/
unsigned int GetIRDistance(unsigned char channle)
{
	xdata unsigned int ucIRDisValue = 0;

	if(channle<0 || channle>10)
	{
		return 0;
	}
	ucIRDisValue = ADC_DistanceGet(channle);

	return ucIRDisValue;

}

/************************************************************
//! 函数名：void ADC_PortInit()
//! 函数说明：ADC引脚初始化
//!----------------------------------------------------------
//! 引脚图：
//!----------------------------------------------------------
//!     引脚             端口              AMX0P
//!
//! 	AD0--------------P1.7--------------0x07
//! 	AD1--------------P2.0--------------0x08
//! 	AD2--------------P2.1--------------0x09
//! 	AD3--------------P2.2--------------0x0A
//! 	AD4--------------P2.3--------------0x0B
//! 	AD5--------------P2.4--------------0x0C
//! 	AD6--------------P2.5--------------0x0D
//! 	AD7--------------P2.6--------------0x0E
//! 	AD8--------------P2.7--------------0x0F
//! 	AD9--------------P3.0--------------0x10
//!
*************************************************************************************************
*****
***** 函数名：void ADC_Init()
***** 入口参数：无
*****
*****
***** 功能描述：ADC初始化
*****						
*****		   
*****
***** 返回值：无
*****
***** 作者：FeiChen
**************************************************************************************************/

void ADC_Init()
{
	unsigned char SFRPAGE_save = SFRPAGE;

	SFRPAGE = CONFIG_PAGE;
	
	ADC0CN	= 0xC0;                        //跟踪模式，开启转换

	ADC0CF = (SYSCLOCK/3000000 - 1) << 3;
	ADC0CF &= ~0x04;                       //右端对齐

	EIE1 &= ~0x08;                         //禁止ADC中断

	//AD0EN = 1;

	REF0CN = 0x08;				//VDD为参考电压，温度传感器关闭，偏压和电压基准关

	SFRPAGE = SFRPAGE_save;

}
/*************************************************************************************************
*****
***** 函数名：unsigned int ADC_DistanceGet(unsigned char AD_port)
*****
***** 入口参数：AD_port：选择的第几路AD端口值，取值为1-10
*****
*****
***** 功能描述：获取对应通道号的AD采样值
*****						
*****		   
*****
***** 返回值：返回对应通道AD采样值，取值范围是0—1024
*****
***** 作者：FeiChen
**************************************************************************************************/

unsigned int ADC_DistanceGet(unsigned char AD_port)
{
	
	xdata unsigned char AD_counter=0;
	xdata unsigned char i = 0;
	xdata unsigned char adc0_h,adc0_l;
	xdata unsigned int ad_test;
	//进行10次AD采样，将对应的AD值保存在数组中
	xdata unsigned int ADC_DataStore[10] = {0,0,0,0,0,0,0,0,0,0};

	//AD端口错误处理，只操作1-10号AD端口
	if(AD_port>0x0A)
	{
		return 0xFF;
	}

	//选中对应的AD端口进行AD采样	
	AD_PortSelection(AD_port);
	
	//开始进行AD转换
	ADC_ConvertStart();
	//进行10次AD采样，将10位采样数据存放在数组中
	for(AD_counter=0;AD_counter<10;AD_counter++)
	{
		while(!AD0INT);

		adc0_h = ADC0H;
		adc0_h &= 0x03;//提取AD采用高两位数据
		adc0_l = ADC0L;//提取AD采用低八位数据
		
        ADC_DataStore[AD_counter] = ((unsigned int)(adc0_h)<<8) + (unsigned int)adc0_l;
		//ADC_DataStore[AD_counter] = (unsigned int)(adc0_l);
		
		AD0INT = 0;	//清ADC0中断标志

		ADC_ConvertStart();
		
		i++;			
	}
		//ADC_FlagClear();


    //ADC_DataStore[0] = ADC_AvrDataGet(ADC_DataStore);
	//return SensorData[AD_port][0];
	ad_test = ADC_AvrDataGet(ADC_DataStore);//获取10次采样的平均值作为当前AD值
	//ad_test++;
	//return (ADC_AvrDataGet(ADC_DataStore));
	return(ad_test);
}
/*************************************************************************************************
*****
***** 函数名：void ADC_ConvertStart()
*****
***** 入口参数：
*****
*****
***** 功能描述：AD转换启动函数，AD转换使能开始。
*****						
*****		   
*****
***** 返回值：
*****
***** 作者：FeiChen
**************************************************************************************************/

void ADC_ConvertStart()
{
	unsigned char SFRPAGE_save = SFRPAGE;

	SFRPAGE = CONFIG_PAGE;

	AD0EN = 1;		//AD转换使能

	//EA = 0;

	AD0INT = 0;		//清楚ADC0中断标志


	AD0BUSY = 1;	//启动ADC0转换

	SFRPAGE = SFRPAGE_save;
}

/*************************************************************************************************
*****
***** 函数名：void AD_PortSelection(AD_port)
*****
***** 入口参数：port_unm——对应需要选择的AD端口号，取值范围是1--10端口
*****
*****
***** 功能描述：AD转换端口配置函数，选中对应通道进行AD输入
*****						
*****		   
*****
***** 返回值：无
*****
***** 作者：FeiChen
**************************************************************************************************/

void AD_PortSelection(unsigned char port_unm)
{
	unsigned char SFRPAGE_save = SFRPAGE;

	SFRPAGE = CONFIG_PAGE;
	
	//1-10号AD端口选择，配置为输入
	switch(port_unm)
	{
		case 0x01: AMX0P = 0x07; break;
		case 0x02: AMX0P = 0x08; break;
		case 0x03: AMX0P = 0x09; break;
		case 0x04: AMX0P = 0x0A; break;
		case 0x05: AMX0P = 0x0B; break;
		case 0x06: AMX0P = 0x0C; break;
		case 0x07: AMX0P = 0x0D; break;
		case 0x08: AMX0P = 0x0E; break;
		case 0x09: AMX0P = 0x0F; break;
		case 0x0A: AMX0P = 0x10; break;

		default: break;

	}	

	AMX0N = 0x1F; //负输入端选择VDD


	SFRPAGE = SFRPAGE_save;

}
/*************************************************************************************************
*****
***** 函数名：unsigned int ADC_AvrDataGet(unsigned int *AD_data)
*****
***** 入口参数：unsigned int *AD_data——对应的是已保存的AD采样值
*****
*****
***** 功能描述：获取平均值
*****			AD值处理函数，将10次采集到的AD值进行排序，选取序号为3、4、5的值进行平均值返回
*****						
*****		   
*****
***** 返回值：返回处理后的平均值
*****
***** 作者：FeiChen
**************************************************************************************************/

unsigned int ADC_AvrDataGet(unsigned int *AD_data)
{
	xdata unsigned int ucAD_avragy,k;
	xdata unsigned int *uiAD_data = AD_data;
	xdata unsigned char i,j;
	xdata unsigned int AD_Array[10];

	//保存10次采样值
	for(i=0;i<10;i++)
	{
		AD_Array[i] = AD_data[i];
	}
	//对10次采样值进行排序
	for(i=0;i<10;i++)
		for(j=0;j<10-i;j++)
		{
			if(AD_Array[j]>AD_Array[j+1])
			{
				k = AD_Array[j];
				AD_Array[j] = AD_Array[j+1];
				AD_Array[j+1] = k;
			}
		}

    //返回其中中间的三个数值平均值
	ucAD_avragy = AD_Array[3] + AD_Array[4] + AD_Array[5];
	 
	return ucAD_avragy/3;

}
/*************************************************************
//! 函数名：void ADC0_ISR (void) interrupt 10
//! 函数说明：ADC中断函数
*************************************************************/
/*void ADC0_ISR (void) interrupt 10
{
	
 }*/


/*************************************************************************************************
*****
***** 函数名：double SensorDistanceProcess(double x )
*****
***** 入口参数：double x——对应的是已经处理过的AD端口采样值
*****
*****
***** 功能描述：ADC值距离转换
*****			通过查询GP2D12曲线表，制作相应的距离和AD值的对应函数关系，进行转换
*****						
*****		   
*****
***** 返回值：返回经过距离转换后的距离值
*****
***** 作者：FeiChen
**************************************************************************************************/
/*************************************************************
//! 函数名：double SensorDistanceProcess(double x )
//! 函数说明：ADC值距离转换
*************************************************************/
double SensorDistanceProcess(double x )
{

	int IRIndex = 0;
	IRIndex = x/4;
	return IRData[IRIndex];

/*
	xdata double result;
	static double final_result;
	result = pow(x, -1.320888871);
	final_result = result * 59599.430602019;
	return final_result;
*/

}    
/*************************************************************
//! 文件结束
*************************************************************/

