

/**********************************************************************************************************
**** 文件名：SystemInit.c
****
**** 文件描述：初始化函数集,延时函数
****
**** 
**** 创建人：Fei Chen
****
**** 版本号：1.0
**** 
**** 修改记录：
****
****
***********************************************************************************************************/

//-----------------------------------------------------------------------------
// 包含文件
//-----------------------------------------------------------------------------

#include "SystemInit.h"

/*************************************************************************************************
*****
***** 函数名：void SystemInit()
*****
***** 入口参数：空
*****
*****
***** 功能描述：初始化函数，包含关闭看门狗定时器，开总中断，内部晶振初始化，SYN6288语音模块初始化，
*****		SMBus(I2C兼容)总线初始化，ADC模块初始化，PWM电机模块初始化，LCD12864显示模块初始化，
*****		外部中断初始化。
*****
*****
***** 返回值：无
*****
***** 作者：FeiChen
**************************************************************************************************/

void SystemInit()
{

	InternalCrystalInit();	//内部晶振初始化
	
	Pin_Config();

	PWM_Init();     		//PWM电机驱动模块初始化 

	ADC_Init();             //AD转换初始化
	
	Delay(50000); 	        //延时等待初始化完成
	
	LCD12864_Init();		//LCD12864模块初始化

	Delay(10000);
	
}

/*************************************************************************************************
*****系统时钟初始化
**************************************************************************************************/
void InternalCrystalInit()
{
	unsigned char SFRPAGE_save = SFRPAGE; 
	
	SFRPAGE = CONFIG_PAGE;

	OSCICN |= 0x83;    //选择内部时钟，四分频
	
	RSTSRC = 0x04;     //丢失时钟检测

	SFRPAGE = SFRPAGE_save; 			
}

/*
**延时函数
*/
void Delay(unsigned int no)
{

		for(; no>0; no--);

}
